---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
source: html/ab21aba0-73de-3689-cf81-317833cea03e.htm
---
# MEPBuildingConstructionSet Methods

Removes every MEPBuildingConstruction from the set, rendering it empty.